---
kind: property
id: P:Autodesk.Revit.DB.MultiReferenceAnnotationType.ReferenceCategoryId
source: html/5d89b166-9eb2-924b-7c8b-ec41508825d0.htm
---
# Autodesk.Revit.DB.MultiReferenceAnnotationType.ReferenceCategoryId Property

The category of elements to which this annotation applies.

## Syntax (C#)
```csharp
public ElementId ReferenceCategoryId { get; }
```

## Remarks
The TagTypeId will be cleared because the user must set a new tag type of an appropriate category.